results/2026-07-09_v7_config_sweep/lfm2.5-8b-a1b/chunked8192/shared_prefix/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31218, dataset_name='generated-shared-prefix', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v7_config_sweep/lfm2.5-8b-a1b/chunked8192/shared_prefix/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=32, gsp_prompts_per_group=32, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31218, dataset_name='generated-shared-prefix', dataset_path='', model='/data/hf/LFM2.5-8B-A1B', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v7_config_sweep/lfm2.5-8b-a1b/chunked8192/shared_prefix/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=32, gsp_prompts_per_group=32, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /home/t-jialianggu/.cache/sglang/benchmark/gen_shared_prefix_1_32_32_2048_128_256_PreTrainedTokenizerFast.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1024/1024 [00:56<00:00, 18.13it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     1024      
Benchmark duration (s):                  56.52     
Total input tokens:                      2413282   
Total input text tokens:                 2413282   
Total generated tokens:                  262144    
Total generated tokens (retokenized):    250236    
Request throughput (req/s):              18.12     
Input token throughput (tok/s):          42695.21  
Output token throughput (tok/s):         4637.79   
Peak output token throughput (tok/s):    6208.00   
Peak concurrent requests:                96        
Total token throughput (tok/s):          47333.00  
Concurrency:                             62.89     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3471.56   
Median E2E Latency (ms):                 2746.53   
P90 E2E Latency (ms):                    5799.88   
P99 E2E Latency (ms):                    17221.43  
---------------Time to First Token----------------
Mean TTFT (ms):                          1998.05   
Median TTFT (ms):                        1287.35   
P99 TTFT (ms):                           15734.61  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.78      
Median TPOT (ms):                        5.69      
P99 TPOT (ms):                           7.45      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           5.78      
Median ITL (ms):                         5.59      
P95 ITL (ms):                            5.94      
P99 ITL (ms):                            6.15      
Max ITL (ms):                            532.97    
==================================================